import streamlit as st
from PIL import Image

image1=Image.open('1.png')
image2=Image.open('2.png')

st.image(image1)
st.title("รู้เรื่องโรคกระดูกพรุนเพื่อป้องกันการหัก")
st.header("แนะนำ")
st.write("โรคกระดูกพรุนคือภาวะที่กระดูกมีความเปราะบางและมีโอกาสหักได้ง่าย")
st.header("โรคกระดูกพรุนคืออะไร?")
st.write("โรคกระดูกพรุน (Osteoporosis) คือ โรคที่ความหนาแน่นและมวลของกระดูกลดน้อยลงจนทำให้กระดูกเสื่อม เปราะบาง ผิดรูป และมีโอกาสแตกหักได้ง่าย ในผู้ป่วยบางรายกระดูกพรุนมีผลให้ส่วนสูงลดลง เนื่องจากมวลกระดูกผุกร่อน ผลจากโรคกระดูกพรุนคือเพิ่มความเสี่ยงต่อการเกิดกระดูกหัก เนื่องจากกระดูกสามารถรับน้ำหนัก แรงกระแทก หรือแรงกดได้ลดลง")
st.header("สาเหตุของโรคกระดูกพรุน")
st.write("กระดูกประกอบด้วยเซลล์สร้างกระดูก (Osteoblast) ทำหน้าที่สร้างกระดูกขึ้นมาใหม่จากแคลเซียมและโปรตีนตามกระบวนการการเจริญเติบโตของร่างกายและช่วยทดแทนกระดูกส่วนที่สึกหรอ และภายในกระดูกยังมีเซลล์สลายกระดูก (Osteoclast) ทำหน้าที่สลายเนื้อกระดูกเก่า\n\nโรคกระดูกพรุนเกิดจากการทำงานที่ไม่สมดุลกันของเซลล์กระดูกทั้ง 2 ชนิดจึงทำให้มีการสลายกระดูกมากกว่าการสร้างกระดูกเกิดขึ้น โดยมีสาเหตุมาจากการที่ปริมาณแคลเซียมในร่างกายไม่เพียงพอต่อกระบวนการสร้างกระดูก หรืออาจมีความผิดปกติของเซลล์กระดูก")
st.image(image2)
st.header("อาการของโรคกระดูกพรุน")
st.write("อาการที่พบได้บ่อยคือ ปวดกระดูก, กระดูกหักง่าย, และการหดตัวของร่างกาย")
st.header("การป้องกันโรคกระดูกพรุน")
st.write("การป้องกันโรคกระดูกพรุนได้แก่ การรับประทานอาหารที่มีแคลเซียมและวิตามินดีสูง, การออกกำลังกายอย่างสม่ำเสมอ, และการหลีกเลี่ยงการสูบบุหรี่และการดื่มแอลกอฮอล์")
st.header("การรักษาโรคกระดูกพรุน")
st.write("การรักษาโรคกระดูกพรุนอาจประกอบด้วยการใช้ยาที่ช่วยเสริมสร้างกระดูก, การเปลี่ยนแปลงวิถีชีวิต, และการบำบัดทางกายภาพ")
st.header("แหล่งข้อมูล")
st.write("ข้อมูลเพิ่มเติมสามารถดูได้ที่ [Bangkok International Hospital](https://www.bangkokinternationalhospital.com/th/health-articles/disease-treatment/know-osteoporosis-to-prevent-fractures)")